#+TITLE: Clojure Tightly Packed Trie

*** Typical "List" data structure

- Iterate through each word starting from the beginning.
- When you get to the first word that starts with the letters "D" "O", start keeping track
  of words
- When you get to the next word that doesn't start with "D" "O", you have all the words you want to use for autocomplete.

#+begin_src clojure
(def dictionary ["Apple" "Banana" "Carrot" "Do" "Dog" "Dot" "Dude" "Egg"])
#+end_src

#+RESULTS:
: #'markov-language-model/dictionary

*** Typical "Trie" in Clojure

#+begin_src clojure
{"A" {:children {"P" {,,,} :value nil}}
 "D" {:children {"O"
                 :children {"G" {:children {} :value "DOG"}
                            "T" {:children {} :value "DOT"}}
                 :value "DO"}
      :value nil}}
#+end_src

#+RESULTS:
: class java.lang.RuntimeException

